package lesson5;/*
 * Created by basar on 25.06.2018
 * Создать массив типа String с размером 7. Записать в него значения дней недели.
 * Вывести на консоль значение последнего элемента.
 */

public class Lesson5_10 {
    public static void main(String[] args) {

        String[] week ={
                "Monday",
                "Tuesday",
                "Wednesday",
                "Thursday",
                "Friday",
                "Saturday",
                "Sunday"
        };
        System.out.println(week[6]);
    }
}
