package lesson5;/*
 * Created by basar on 25.06.2018
 * Создать массив типа double с размером 4.
 * Записать в него любые значения с помощью блока для инициализации.
 * Вывести на консоль значение первого элемента.
 */

public class Lesson5_11 {
    public static void main(String[] args) {
        double n = Double.parseDouble(args[0]);
        System.out.println(n);
    }
}
